app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"   ORDER BY created_at DESC
---
  def index
    if params[:tag]
      @articles = Article.tagged_with(params[:tag])
    elsif params[:search]
      @articles = Article.search(params[:search]).order("created_at DESC")

INSERT INTO "articles" ("costo", "created_at", "direccion", "email", "pic_content_type", "pic_file_name", "pic_file_size", "pic_updated_at", "text", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
def create
  @article = Article.new(article_params)
  @article.save